EAtest/T2/background/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# Create background mesh
runApplication blockMesh




restore0Dir

# Use cellSets to write zoneID
runApplication setFields

runApplication decomposePar
#------------------------------------------------------------------------------
